tutorials/heatTransfer/chtMultiRegionFoam/snappyMultiRegionHeater/0/topAir/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/topAir";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.01;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    minX
    {
        type            fixedValue;
        value           $internalField;
    }
    maxX
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    "(min|max)(Y|Z)"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    "topAir_to_.*"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
