tutorials/heatTransfer/chtMultiRegionFoam/snappyMultiRegionHeater/system/bottomAir/SYMLINKS.txt
The original source for 'decomposeParDict' was '../decomposeParDict'
