tutorials/heatTransfer/chtMultiRegionFoam/snappyMultiRegionHeater/system/heater/SYMLINKS.txt
The original source for 'decomposeParDict' was '../decomposeParDict'
