tutorials/heatTransfer/chtMultiRegionFoam/snappyMultiRegionHeater/system/leftSolid/SYMLINKS.txt
The original source for 'decomposeParDict' was '../decomposeParDict'
The original source for 'fvSchemes' was '../heater/fvSchemes'
The original source for 'fvSolution' was '../heater/fvSolution'
